src/Documents/ИС_WB_СборочноеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_WB_СборочноеЗадание</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>article</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>convertedPrice</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>isLargeCargo</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>orderUid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fullAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fio</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>longitude</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>latitude</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВВалютеУчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавочныеКоды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>address</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>province</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>area</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>city</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>street</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>home</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>flat</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>entrance</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>longitude</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>latitude</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>offices</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>prioritySc</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>skus</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>user</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>fio</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>phone</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_ПоставкиFBS</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_WB_СтатусыСборочныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусWB</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>partA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>partB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этикетка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СборочноеЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_WB_СборочноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_ВБ_ТипыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ВБ_ТипыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBW</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EDBS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CnC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FBO</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИС_WB_СборочноеЗадание/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 07.07.22 УА #46999
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОформлениеНаСервере();
	ПолучитьИнформациюОСтатусах();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 04.07.22 УА #46999
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОформление();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
		
	Режим = РежимДиалогаВопрос.ДаНет;
	
	ДопПараметры = Новый Структура("Поставка", ВыбранноеЗначение);
	Оповещение = Новый ОписаниеОповещения("ПрикреплениеКПоставкеЗавершение", ЭтотОбъект, ДопПараметры);
	Текст = СтрШаблон("Прикрепить выделенные задания к поставке: %1?", ВыбранноеЗначение); 
	ПоказатьВопрос(Оповещение, Текст, Режим, 0);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 13.07.22 УА #46999
&НаКлиенте
Процедура ЗагрузитьСборочноеЗадание(Команда)
	ЗагрузитьСборочноеЗаданиеНаСервере(Объект.Профиль, Объект.Дата);
	Прочитать();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 14.07.22 УА #46999
&НаКлиенте
Процедура ОтменитьЗадание(Команда)

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ОтменитьЗаданиеЗавершение", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Уверены что хотите отменить сбороное задание?'"), Режим, 0);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.07.22 УА #46999 

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура ПрикрепитьКПоставке(Команда)
	
	ПараметрыОтбора = Новый Структура("Профиль", Объект.Профиль);
	ПараметрыОтбора.Вставить("ТипТовара", Объект.ТипТовара);
	ПараметрыОтбора.Вставить("done", Ложь);
	ПараметрыОтбора.Вставить("ПометкаУдаления", Ложь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Справочник.ИС_ВБ_ПоставкиFBS.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.06.24 УА #77581
&НаКлиенте
Процедура ДекорацияОткрытьНаКартеНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке("https://maps.yandex.ru/?text=" + Объект.latitude + "+" + Объект.longitude); 
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.06.24 УА #77581

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 04.07.22 УА #46999
&НаКлиенте
Процедура УстановитьОформление()
		
	Если Не Объект.Ссылка.Пустая() Тогда
	   
	   	ШрифтПолужирный = ПолучитьШрифтПолужирный();
	   	
		Элементы.Номер.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Номер.Шрифт = ШрифтПолужирный;
		Элементы.Номер.Формат = "ЧГ=0";
		Элементы.Дата.Вид = ВидПоляФормы.ПолеНадписи; 
		Элементы.Дата.Шрифт = ШрифтПолужирный; 
		Элементы.Профиль.Вид = ВидПоляФормы.ПолеНадписи; 
		Элементы.Профиль.Шрифт = ШрифтПолужирный;
		
		Если ЗначениеЗаполнено(Объект.Склад) Тогда
			Элементы.Склад.Вид = ВидПоляФормы.ПолеНадписи; 
			Элементы.Склад.Шрифт = ШрифтПолужирный;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Валюта) Тогда
			Элементы.Валюта.Вид = ВидПоляФормы.ПолеНадписи; 
			Элементы.Валюта.Шрифт = ШрифтПолужирный;
		КонецЕсли;
		
	КонецЕсли;
	
	//+ ИнфоСофт Сумин Д.В. 26.04.2024 УА #70825 
	Если ЗначениеЗаполнено(Объект.ВалютаПродажи) тогда
		Элементы.ВалютаПродажи.Вид = ВидПоляФормы.ПолеНадписи; 
		Элементы.ВалютаПродажи.Шрифт = ШрифтПолужирный;	
	КонецЕсли;
	
	Если Объект.price = Объект.convertedPrice Тогда
		Элементы.convertedPrice.Видимость = Ложь;
		Элементы.Валюта.Видимость = Ложь;
		Элементы.ДекорацияЦенаПоставщика.Видимость = Ложь;
		Элементы.ДекорацияВалюта.Видимость = Ложь;
	КонецЕсли;
	//Если Объект.price = Объект.convertedPrice Тогда
	//	Элементы.price.Видимость = Ложь;
	//	Элементы.Валюта.Видимость = Ложь;
	//КонецЕсли;
	//- ИнфоСофт Сумин Д.В. 26.04.2024 УА #70825
	
	//+ ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469
	Если Объект.ТипДоставки = ПредопределенноеЗначение("Перечисление.ИС_ВБ_ТипыДоставки.FBO") Тогда
		Элементы.ПрикрепитьКПоставке.Доступность = Ложь;
		Элементы.ОтменитьЗадание.Доступность = Ложь;
		Элементы.ФормаЗагрузитьСборочноеЗадание.Доступность = Ложь;
	КонецЕсли;
	//- ИнфоСофт Стояк Ю.К. 03.03.2025 УА #93469 
		 
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 04.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 14.07.22 УА #46999
&НаСервере   
Процедура УстановитьОформлениеНаСервере()

	//Элементы.ГруппаОшибки.Видимость = ПроверитьНаличиеОшибок(Объект.Ссылка);
	//
	//СтатусФинальный = Объект.Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.СборочноеЗаданиеЗавершено
	//	Или Объект.Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.СборочноеЗаданиеОтклонено
	//	Или Объект.Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.КурьерДовезИКлиентПринялТовар
	//	Или Объект.Статус = Перечисления.ИС_WB_СтатусыСборочныхЗаданий.КлиентНеПринялТовар;
	//
	//Если СтатусФинальный Тогда 
	//    
	//	Элементы.УстановитьСтатус.Видимость = Ложь;
	//	Элементы.Статус.Вид = ВидПоляФормы.ПолеНадписи; 
	//	Элементы.Статус.Шрифт = ШрифтыСтиля.ИС_ШрифтПолужирный;
	//		
	//КонецЕсли;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаСервере   
Процедура ПолучитьИнформациюОСтатусах()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Поставка КАК Поставка,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Статус КАК Статус,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СтатусWB КАК СтатусWB,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.ДатаДоставкиС КАК ДатаДоставкиС,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.ДатаДоставкиПо КАК ДатаДоставкиПо
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ИС_WB_СборочноеЗадание.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_СборочноеЗадание.Профиль = &Профиль
	|				И ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB)
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка = &СборочноеЗадание";
	
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);
	Запрос.УстановитьПараметр("СборочноеЗадание", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);	
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 13.07.22 УА #46999
&НаСервереБезКонтекста
Процедура ЗагрузитьСборочноеЗаданиеНаСервере(Профиль, Дата)
	ИС_ВБ_Сервер.ВыполнитьЗагрузкуЗаказов(Профиль, Дата - 1, Дата + 1);
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура ОтменитьЗаданиеЗавершение(Результат, Параметры) Экспорт
    
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

	ОтменитьЗаданиеНаСервере(Объект.Профиль, Объект.Номер);
    
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 14.07.22 УА #46999
&НаСервереБезКонтекста
Процедура ОтменитьЗаданиеНаСервере(Профиль, Номер)	
	ИС_WB_Сервер.ОтменитьСборочноеЗадание(Профиль, Номер);	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 14.07.22 УА #46999

//+ ИнфоСофт Ивонин К.А. 23.01.23 УА #53535
&НаСервереБезКонтекста
Функция ПолучитьШрифтПолужирный()
	Возврат Новый Шрифт( , 10, Истина);	
КонецФункции //- ИнфоСофт Ивонин К.А. 23.01.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаКлиенте
Процедура ПрикреплениеКПоставкеЗавершение(Результат, Параметры) Экспорт
    
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ПрикрепитьЗаказыКПоставкеНаСервере(Параметры.Поставка);
    ПолучитьИнформациюОСтатусах();

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535

//+ ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
&НаСервере
Процедура ПрикрепитьЗаказыКПоставкеНаСервере(Поставка)
	
	ВыделенныеСтроки = Новый Массив();
	ВыделенныеСтроки.Добавить(Объект.Ссылка);
	ИС_ВБ_Сервер.ДобавитьСборочныеЗаданияВПоставку(Объект.Профиль, Поставка, ВыделенныеСтроки);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.23 УА #53535
  
#КонецОбласти
